{
  "projects": 
  [
      {
      "bkgClass": "d4sd",
      "bkgColor": "#4496e1",
      "year": "2017",
      "projectTitle": "D4SD",
      "detLabels": "DEVELOPMENT+DESIGN, WEBSITE",
      "detDescr": "D4SD is an online civic engagement platform in San Diego. For the 2017 cycle, it challenged local citizens and designers to prototype solutions for problems centered in four mobility-based categories (walking/biking, accessibility, commuter experience, and autonomous vehicles) using a provided human-centered design process. The site itself provides information and resources for each challenge, as well as serves as a launchpad into the process for contestants.",
      "leftImgPath": "/img/preview-d4sd.png", 
      "siteLink": "https://d4sd.org",
      "atAGlance": [
        {
          "glanceTitle": "Tech Used",
          "glanceDet": "React, SASS, GSAP, Travis, AWS"
        },
        {
          "glanceTitle": "Design Programs Used",
          "glanceDet": "Sketch, Invision"
        },
        {
          "glanceTitle": "The Team",
          "glanceDet": "Cross-function team of 30 people. Included other developers, designers (ux/ui and visual), ux researchers, copy/content writers, management, stakeholders, sponsors, and outside teams."
        },
        {
          "glanceTitle": "Main Takeaway",
          "glanceDet": "Working on a large team on a large-scale project takes a nuanced approach. Also, the mythical man-month is real. Onboarding new team members takes a significant lead time."
        },
        {
          "glanceTitle": "In The News",
          "glanceDet": "<ul id=\"glance-articles\"><li><span class=\"article-src\">[SD TRIBUNE]</span> <a class=\"paragraph-link\" href=\"http://www.sandiegouniontribune.com/business/growth-development/sd-fi-mobility-20170915-story.html\" target=\"_blank\" rel=\"noopener noreferrer\">Public invited to all-night hackathon to solve San Diego's commuting nightmare</a></li><li><span class=\"article-src\">[UCSD NEWS]</span> <a class=\"paragraph-link\" href=\"http://ucsdnews.ucsd.edu/pressrelease/public-invited-to-design-solutions-to-our-citys-biggest-issues\" target=\"_blank\" rel=\"noopener noreferrer\">Public Invited to Design Solutions to Our City’s Biggest Issues</a></li><li><span class=\"article-src\">[PSN]</span> (en español) <a class=\"paragraph-link\" href=\"https://psn.si/desafian-poblacion-transporte/2017/09/\" target=\"_blank\" rel=\"noopener noreferrer\">Desafían a la población a enfrentar los problemas de transporte en San Diego</a></li><ul>"
        }
      ],
      "projFeatures": [
        { 
          "pageIMG": "/img/d4sd/features/home.png",
          "pageAlt": "home page",
          "featTitle": "Dive into the Challenge",
          "featDetails": "d4sd.org provides a place for users to learn about the Design for San Diego civic design challenge. It contains relevant resources, links, updates, and contact information for participants.",
          "pageIMG2": "/img/d4sd/features/challengebrief.png",
          "pageAlt2": "Challenge Brief Page",
          "featTitle2": "Learn about the Problem Space",
          "featDetails2": "Read engaging articles about the challenges and information for specific problems in the design space."
        },
        {
          "pageIMG": "/img/d4sd/features/resources.png",
          "pageAlt": "resource page",
          "featTitle": "Stay Up-to-Date",
          "featDetails": "Our team provides a curated collection of external news articles relevant to various challenges.",
          "pageIMG2": "/img/d4sd/features/getInvolved.png",
          "pageAlt2": "Get Involved Page",
          "featTitle2": "Get Involved",
          "featDetails2": "Want to dive into the challenge? The site provides a control center to lauch users into the design process."
        },
        {
          "pageIMG": "/img/d4sd/features/faq.png",
          "pageAlt": "help center page",
          "featTitle": "Help is Here",
          "featDetails": "Read through our FAQs to get answers for any burning questions.",
          "pageIMG2": "/img/d4sd/features/mobile.png",
          "pageAlt2": "Mobile Version of Site",
          "featTitle2": "On the Go?",
          "featDetails2": "No worries, the site is responsive. Get everything right on your mobile phone."      
        }
      ],
      "moreDet": 
      [
        {
          "moreDetTitle": "My Roles",
          "moreDetContent":
          [
            "I was an UX Engineer whose roles were to build out prototypes and optimize the site. But as the launch date neared and the iteration cycles became shorter, I took on a multi-functional role that spanned from designing to front-end development, depending on what was needed at the moment.  I was a liaison between the design and development teams, and also communicated with the marketing team as we shaped the site and its content.",
            "Earlier in the process, I also contributed significantly as a product designer. I used user research analysis, literature review, and existing product comparisons to develop the core principles and flow of the challenge process and how they would be displayed on a digital medium. I also designed lo-fi and hi-fi prototypes for the pages on the site, as well as created some graphical elements such as icons."
          ]
        },
        {
          "moreDetTitle": "The Goal",
          "moreDetContent":
          [
            "To design and build a robust, online platform that San Diego citizens can use to identify root problems within civic issues and prototype solutions through group deliberation."
          ]
        },
        {
          "moreDetTitle": "The Background",
          "moreDetContent": 
          [
            "While a lot of focus is given to politics at a national level, local-level politics often flies under the radar. Voter turnout in local elections hovers around 20%, which compared to 2016’s presidential election turnout of 58%, is considerably lower. An issue arises where citizens are dissatisfied with politics and the outcomes, and yet do not engage with the level of government that affects them the most.",
            "Part of the problem is the difficulty of accessing the deliberation process before the decisions are made. For instance, town halls, popular forums for voicing concerns to city council members, are typically held on weekdays in the middle of the day, making it difficult for students or working individuals to attend.",
            "Our solution to this was to create an online platform, an accessible mode of communication where users could directly engage in civic debate without being constrained by time or a physical location.",
            "This solution, however, created its own set of challenges. There is a lot of benefit to face-to-face interactions. Being able to detect tone, read body language, and deliberate in real time gives invaluable context and creates momentum that can result in a constructive debate. While online forms of communication are more accessible, they eliminate these context clues and create asynchronicity problems that can curb or stop the flow of dialogue. There’s a challenge to balancing these tradeoffs while trying to gain more benefits than costs."
          ]
        },
        {
          "moreDetTitle": "Model Creation",
          "moreDetImgPath": [
            "/img/d4sd/model.jpg"
          ],
          "moreDetContent": 
          [
            "Compiling user research, literature review and platform comparisons, our group developed the following model for designing solutions for a civic project. I helped digitize this model into an infographic using Sketch."
          ]
        },
        {
          "moreDetTitle": "Process Flow Diagram",
          "moreDetImgPath": [
            "/img/d4sd/processFlow.jpg"
          ],
          "moreDetContent": 
          [
            "We translated the design model we created into a flow for users. We developed a hybrid offline/online model, where the first two stages were performed in-person, utilizing a design class to generate interview/observation data, and perform root cause analysis. Then, we made that data available to online users, who used our tool to form teams and engage in the Prototype phase by designing solutions. The Implementation stage would happen offline, and depended on the commitment of outside entities (ie, from the government or sponsors).",
            "While some of the specific technologies listed in the flow diagram below were not used in the final product, the general flow remained the same. I created this diagram for our team using Powerpoint."
          ]
        },
        {
          "moreDetTitle": "Site Flow Diagram",
          "moreDetImgPath": [
            "/img/d4sd/flow-diagram.png"
          ],
          "moreDetContent": 
          [
            "We then listed the features of the process and compartmentalized them into pages in a way that the user would have a clear system image when they navigated the site.",
            "More pages were added later, but the five main pages/templates we needed were a landing page, a team/about page, a “get involved” page for launching users into other features (this included forming teams, discussing topics, etc), a “challenge index” page which listed all of the possible mobility challenge ideas, and a page for each challenge that would function a as a wiki page for info and outside resources. I also created this chart using Powerpoint."
          ]
        },
        {
          "moreDetTitle": "Lofi Wireframes",
          "moreDetImgPath": [
            "/img/d4sd/whiteboarding.jpg"
          ],
          "moreDetContent": 
          [
            "Compiling user research, literature review and platform comparison, our group developed the following model for designing solutions for a civic project:"
          ]
        },
        {
          "moreDetTitle": "Hifi Wireframes",
          "moreDetImgPath": [
            "/img/d4sd/wireframes.jpg"
          ],
          "moreDetContent": 
          [
            "For an earlier version of the site, and before I took on a more development-heavy role, I helped create high-fidelity mockups. One of the challenges we encountered was that the requirements and the specs were rapidly changing, and so we had to constantly iterate from whiteboard to hi-fi prototypes within the span of days to address new constraints and goals. We found that the invision prototype was useful as a tool to quickly get a feel for look and flow of the site, which helped when we solicited feedback from the testers and sponsors.",
            "Below the image is a link to one of the invision mockups I helped make. I made a few of the pages, notably the index page, the challenge index page, and the team page, and arranged all the wireframes on invision. Not all of the pages were completed at that point, and the design has since changed."
          ],
          "btnTitle": "VIEW INVISION PROTOTYPE",
          "btnLink": "https://projects.invisionapp.com/share/9QBOKS9VR#/screens/233401076"
        }, 
        {
          "moreDetTitle": "Development Process",
          "moreDetContent": [
            "Details coming soon."
          ]
        },
        {
          "moreDetTitle": "Iconography",
          "moreDetImgPath": [
            "/img/d4sd/icons/alltogethernow.jpg"
          ],
          "moreDetContent": 
          [
            "I made icons to represent the four main stages of the design process. I designed them using a wire style design to complement the theme of the site, and created them using Sketch."
          ]
        },
        {
          "moreDetTitle": "Kickoff Hackathon",
          "moreDetImgPath": [
            "/img/d4sd/kickoffEvent.jpg"
          ],
          "imgCaption": "Photo by Erik Jepsen/UC San Diego Publications",
          "moreDetContent": 
          [
            "We held a kickoff event to launch contestants into the projects. About 100 individuals attended, and they were given a period of time to begin hashing out their solutions. Design Lab Director Don Norman, UCSD Chancellor Pradeep K. Khosla, and San Diego Mayor Kevin Faulconer also attended and made opening remarks."
          ]
        },
        {
          "moreDetTitle": "Design Forward Event",
          "moreDetContent": 
          [
            "Details coming soon."
          ],
          "btnTitle": "VISIT DF'S PAGE ABOUT IT",
          "btnLink": "http://www.designforwardsd.com/the-action/"
        },
        {
          "moreDetTitle": "The Takeaway",
          "moreDetContent": 
          [
            "D4SD was a year-long project for which <span class=\"det-highlights\">I contributed as a Front-End Developer, Product Designer, and UX Engineer.</span> I observed every part of the process, from literature review to UX/UI design to development, and gained valuable insights into how each part works together.",
            "One observation is that having knowledge of programming and design allowed me to bridge the gap and design wireframes that could both solve UX problems and be quickly and reliably implemented given the structure of the system. This turned out to be valuable, because we were working on three-week cycles from lo-fi wireframes to first builds for most of production.",
            "Another observation is that <span class=\"det-highlights\">an important component of system design is understanding the skill set of your team and the problem at hand</span>. We over-engineered our site, using a complex tech stack that takes a non-trivial amount of time to learn, and provided features and benefits that we did not end up needing. This led to lengthy onboarding times down the road, especially as the release date neared.",
            "This feeds into the next observation, that <span class=\"det-highlights\">onboarding new members has a lead time cost</span>. It takes time to introduce new members to an existing system and existing workflow. Specifically for development, there is an additional configuration and initialization step which, for our team, took about a day or two on average.",
            "Finally, <span class=\"det-highlights\">within complex projects that have fast turnarounds, prioritization of objectives is highly important</span>. We often had issues that would have been nice to fix, but not feature-breaking and time consuming to implement. In the face on an impending deadline and the existence of other feature-breaking bugs, being able to rank the issues in terms of impact and implementation time helped us make the most effective fixes given the constraints."
          ]
        }
      ]
    },
        {
      "bkgClass": "personal",
      "year": "2017",
      "projectTitle": "laurenliu.me",
      "detLabels": "DEVELOPMENT+DESIGN, WEBSITE",
      "detDescr": "Coming Soon"
    },
    {
      "bkgClass": "dopeLst",
      "year": "2017",
      "projectTitle": "dopeLst",
      "detLabels": "DESIGN+DEVELOPMENT, WEBSITE (PWA)",
      "detDescr": "dopeLst is a CRUD application designed to be an index of your music library. Given the plethora of music format and service options, many people’s discography spans several different devices. dopeLst provides a fast and cached platform to ground all of that information in one place.",
      "leftImgPath": "/img/preview-dope.png", 
      "siteLink": "https://dopelst-a697d.firebaseapp.com/",
      "atAGlance": [
        {
          "glanceTitle": "Tech Used",
          "glanceDet": "Vue.js, HTML/SASS, Firebase, Sketch"
        },
        {
          "glanceTitle": "The Team",
          "glanceDet": "3 Developers"
        },
        {
          "glanceTitle": "Main Takeaway",
          "glanceDet": "Low latency is incredibly important. Tradeoffs in site speed are usually made at the expense of code complexity or aesthetics. Also dropshadows? Surprisingly expensive."
        },
        {
          "glanceTitle": "It Won Some Things",
          "glanceDet": "🏆 Top 3 Fastest Sites in the Class, 🏆 Top Tier UX/UI in the Class"
        }, 
        {
          "glanceTitle": "A Fun Fact",
          "glanceDet": "It’s a PWA!"
        }
      ],
      "moreDet": 
      [
        {
          "moreDetTitle": "My Roles",
          "moreDetContent": [
            "I designed the flow of the site, designed the wireframes, and contributed to the front-end development of the site."
          ]
        },
        {
          "moreDetTitle": "The Goal",
          "moreDetContent": [
            "To build a CRUD indexing site that is clean and fast even under limited network conditions."
          ]
        },
        {
          "moreDetTitle": "Context",
          "moreDetContent": [
            "Coming Soon."
          ]
        },
        {
          "moreDetTitle": "Hi-Fi Wireframes",
          "moreDetContent": [
            "Our focus was to design a platform that was clean, intuitive, and most importantly fast. I made these wireframes with these goals in mind. Since the purpose of this app was an exercise in creating a fast CRUD application, we did not perform user testing, and instead focused our research on design practices that increased speed. This led to decisions such as <a class=\"paragraph-link\" href=\"https://medium.com/airbnb-engineering/css-box-shadow-can-slow-down-scrolling-d8ea47ec6867\" target=\"blank\" rel=\"noopener noreferrer\">limiting dropshadows</a>. We tested our choices using <a class=\"paragraph-link\" href=\"https://developers.google.com/web/tools/lighthouse/\" target=\"_blank\" rel=\"noopener noreferrer\">Google Lighthouse</a>, which among other things rated us on speed performance, and also helped in improving our coding style quality."
          ],
          "moreDetImgPath": [
            "/img/dopelst/wf-splash-page-min.jpg",
            "/img/dopelst/wf-playlist-details-view-min.jpg",
            "/img/dopelst/wf-album-index-view-min.jpg",
            "/img/dopelst/wf-album-click-play.jpg",
            "/img/dopelst/wf-faq-min.jpg"
          ]
        },
        {
          "moreDetTitle": "Development",
          "moreDetContent": [
            "Details coming Soon."
          ],
          "btnTitle": "CHECKOUT THE SITE",
          "btnLink": "https://dopelst-a697d.firebaseapp.com/"
        },
        {
          "moreDetTitle": "The Takeaway",
          "moreDetContent": 
          [
            "<span class=\"det-highlights\">Latency is very important, and design significantly affects it.</span> According to RAIL, if load time for a page exceeds one second, the flow will be broken and the user’s attention will wander. We made compromises on designs to speed up our site, for instance <a class=\"paragraph-link\" href=\"https://medium.com/airbnb-engineering/css-box-shadow-can-slow-down-scrolling-d8ea47ec6867#.b8jj29awr\">eliminating box shadows</a>  to speed scrolling times and reducing the number of gradients.",
            "Additionally, <span class=\"det-highlights\">as phones become the primary way users browse the internet, a mobile-first approach becomes increasingly important</span>. As a result, we made special design and build considerations for mobile browsers since they are slower than computers at loading data, which is only compounded by faulty wifi and slow data speeds.",
            "One of our solutions was to create a separate, flatter style for the mobile playlist. We also used media queries to handle screen-size detection and wrote it such that our mobile styles were default and our tablet and desktop styles were handled by the queries. This greatly reduced the amount of selectors the mobile browser had to parse through.",
            "Our second solution, <span class=\"det-highlights\">designing it as a PWA, also helped reduce load times and reduced the effect of unreliable networks.</span> It also provides some advantages of native apps (fast data fetches, offline access via caching) without the initialization cost of having to configure an app."
          ]
        }
      ]
    },
    {
      "bkgClass": "frank",
      "year": "2015",
      "projectTitle": "Frank",
      "detLabels": "DESIGN+DEVELOPMENT, WEBSITE (MOBILE VIEW ONLY)",
      "detDescr": "Frank is a social network application designed to help users improve their fashion. Users can post photos of their clothes and recieve brutally honest critiques in the form of either upvotes or comments.",
      "leftImgPath": "/img/preview-frank.png",
      "siteLink": "https://frank-app.herokuapp.com/",
      "altText": "MOBILE SITE",
      "atAGlance": [
        {
          "glanceTitle": "Tech Used",
          "glanceDet": "Node.js, HTML/CSS, Bootstrap, MongoDB"
        },
        {
          "glanceTitle": "Design Programs Used",
          "glanceDet": "Photoshop, Illustrator, Invision"
        },
        {
          "glanceTitle": "The Team",
          "glanceDet": "3 Hybrid-Role Developer/Designers"
        },
        {
          "glanceTitle": "Main Takeaway",
          "glanceDet": "Fail fast and fail often. \"You are not the user.\" And Bootstrap has its pros and cons&mdash;it’s a powerful rapid prototyping tool but is difficult to customize among other things."
        }, 
        {
          "glanceTitle": "A Fun Fact",
          "glanceDet": "Frank is short for “Be Frank,” which represented our angle for our site: a platform where users could provide brutally honest fashion feedback."
        }
      ],
      "projFeatures": [
        { 
          "pageIMG": "/img/frank/features/login.png",
          "pageAlt": "home page",
          "featTitle": "Dive into the Challenge",
          "featDetails": "d4sd.org provides a place for users to learn about the Design for San Diego civic design challenge. It contains relevant resources, links, updates, and contact information for participants.",
          "pageIMG2": "/img/frank/features/home.png",
          "pageAlt2": "Challenge Brief Page",
          "featTitle2": "Learn about the Problem Space",
          "featDetails2": "Read engaging articles about the challenges and information for specific problems in the design space."
        },
        {
          "pageIMG": "/img/frank/features/search.png",
          "pageAlt": "resource page",
          "featTitle": "Stay Up-to-Date",
          "featDetails": "Our team provides a curated collection of external news articles relevant to various challenges.",
          "pageIMG2": "/img/frank/features/submit.png",
          "pageAlt2": "Get Involved Page",
          "featTitle2": "Get Involved",
          "featDetails2": "Want to dive into the challenge? The site provides a control center to lauch users into the design process."
        }
      ],
      "moreDet": 
      [
        {
          "moreDetTitle": "My Roles",
          "moreDetContent": 
          [
            "I performed user research, designed the lofi and hifi wireframes, and helped develop the prototype site."
          ]
        },
        {
          "moreDetTitle": "The Goal",
          "moreDetContent": 
          [
            "To use the Human-Centered Design to needfind, ideate, prototype, test, and build a transaction site for a mobile browser."
          ]
        },
        {
          "moreDetTitle": "The Background",
          "moreDetContent": 
          [
            "Honest fashion advice is difficult to come by. Friends and family may provide white lies to avoid hurting your feelings, salespeople may say anything to get you to buy their clothes, and singular opinions may not represent that of the general public. We strove to solve this problem by providing a platform for users to receive and give feedback without limitations."
          ]
        },
        {
          "moreDetTitle": "Needfinding",
          "moreDetContent": 
          [
            "We conducted interviews with UCSD students. We had an idea that we wanted to have an app centered around fashion, and so we centered our needfinding process around that. We conducted interviews with people, and discovered early on that many of our interviewees expressed that they wanted a way to improve their fashion, particularly when they were buying new clothes. Taking that knowledge, we observed several interviewees as they shopped for clothes (either online or in person), and discovered that a vital step in the shopping process is asking others for critiques. We noticed that staff at some stores tended to make comments in an effort to convince the individual to buy more clothes. Friends were not dependable, there were some that offered useful advice, there were some that gave soft feedback to avoid hurting feelings, and there were some that had a different sense of fashion taste as the interviewee. Additionally, interviewees were reluctant to ask strangers because of various social pressures.",
            "Using the insights we gained from needfinding, we determined that we wanted to create an app that helped users solicit honest feedback. We felt that the anonymous nature of the internet would allow users to critique and be critiqued without the fear of social stigmas."

          ]
        },
        {
          "moreDetTitle": "Storyboarding",
          "moreDetImgPath": [
            "/img/frank/storyboard.jpg"
          ],
          "moreDetContent": 
          [
            "We created storyboards to represent the main use cases for our App. We made a storyboards for our main case, which was that advice from strangers on our app would give more accurate and honest advice than a friend. One of the storyboards is pictured above."
          ]
        },
        {
          "moreDetTitle": "Paper Prototypes",
          "moreDetImgPath": [
            "/img/frank/wf-lofi-1.jpg"
          ],
          "moreDetContent": 
          [
            "Our next step was to create paper prototypes. Paper prototypes allowed us the cheaply and quickly work out and test the flow of our app. After finalizing our paper apps, we tested them with several users and noted their observations as well as heuristic violations. Some commentary we received, was that some sections were quite text-heavy and some of the buttons were too small."
          ]
        },
        {
          "moreDetTitle": "Lofi Prototypes",
          "moreDetImgPath": [
            "/img/frank/wf-med.jpg"
          ],
          "moreDetContent": 
          [
            "We then converted our paper prototypes to digital prototypes. We first converted our lofi paper prototypes into medium-fidelity digital prototypes."            
          ]
        },
        {
          "moreDetTitle": "Hifi Prototypes",
          "moreDetImgPath": [
            "/img/frank/wf-hifi.jpg"
          ],
          "moreDetContent": [
            "We then converted our medium-fidelity prototypes into higher-fidelity one, layering on styles for elements such as fonts and colors. Constructing the high-fidelity prototype was important because it allowed us to set the style and feel of the app in a way that was cheap and fast to edit.",
            "In 2016, as a personal project for myself, I redesigned Frank. The image below contains the hifi wireframes from the redesign. I adjusted colors and styles, but also came up with a more indepth comment system. Most of these adjustments came from the feedback we received from our prior iteration."
          ],
          "btnTitle": "INVISION PROTOTYPE COMING SOON",
          "btnLink": "/",
          "noLink": "yes"
        },
        {
          "moreDetTitle": "Development Process",
          "moreDetContent": [
            "Details coming soon. In the meantime, you can checkout the prototype we built using the button below. It was only built to be mobile compatible, and may have some issues displaying correctly on a larger browser."
          ],
          "btnTitle": "VIEW PROTOTYPE SITE",
          "btnLink": "https://frank-app.herokuapp.com/login"
        },
        {
          "moreDetTitle": "Icons",
          "moreDetContent": 
          [
            "I created several icons for the site using Adobe Illustrator. I used a flat style which I felt completed the aesthetic of the app as well as the icon styles that were popular in 2015. Most of them were used on the search page of the app to complement the categories listed there, the file icon on the right was used on the file-upload page."
          ],
          "iconDump": [
            "/img/frank/icons/icon_clothing.png",
            "/img/frank/icons/icon_facialhair.png",
            "/img/frank/icons/icon_hairstyles.png",
            "/img/frank/icons/icon_makeup.png",
            "/img/frank/icons/icon_shoes.png",
            "/img/frank/icons/icons_clothing.png"
          ],
          "iconType": "no-bckgrd"
        },
        {
          "moreDetTitle": "The Takeaway",
          "moreDetContent": 
          [
            "<span class=\"det-highlights\">We learned that we are not the user.</span> There were some great insights that we gleaned from interviews that we wouldn’t have thought of ourselves. For instance, originally we had a menu of categories as our index screen, but a few of our interviewees mentioned that it would be nice if it was a trending-based post feed of posts from all categories. We ended up incorporating that into our app.",
            "<span class=\"det-highlights\">Lofi prototypes are important and allow us to fail fast and fail often.</span> Having people test our flow through paper prototypes worked out a number of the kinks in our app before we spent time refining it with a hifi wireframe. Using this method allowed us to develop the final solution and product faster and prevented rework with prototypes that were most costly in terms of time and work.",
            "Finally, <span class=\"det-highlights\">Bootstrap is a highly powerful tool for rapid prototyping,</span> especially with its responsive grid system. <span class=\"det-highlights\">However, there are a handful of tradeoffs that crop up as a result,</span> and so it's not always the right tool for the job.",
            "<ol class=\"paragraph-ul\"><li class=\"paragraph-li\"><span class=\"takeaway-category\">Lead Time:</span> If the programmer is not familiar with Bootstrap, there is a slight learning curve, which can hamper rapid cycles.</li><li class=\"paragraph-li\"><span class=\"takeaway-category\">Div City:</span> We ended up using a lot of divs, so there was an insane amount of nesting.</li><li class=\"paragraph-li\"><span class=\"takeaway-category\">Big Files:</span> The entire library is also huge which heavily cramps load speeds. Customizing it drastically reduces file size but took time and project foresight that we lacked then.</li><li class=\"paragraph-li\"><span class=\"takeaway-category\">Change is Difficult:</span> It’s not friendly towards style customization.</li> <li class=\"paragraph-li\"><span class=\"takeaway-category\">A Risk for Homogeneity:</span> If you stick with Bootstrap default styles, your site ends up looking like pretty much <a class=\"paragraph-link\" href=\"http://adventurega.me/bootstrap/\" target=\"blank\" rel=\"noopener noreferrer\">every other Bootstrap site out there</a>.</li></ol>"
          ]
        }
      ]
    },
    {
      "bkgClass": "avics",
      "year": "2017",
      "projectTitle": "A.V.I.C.S",
      "detLabels": "DESIGN CONCEPT, PRINT DESIGN",
      "detDescr": " A.V.I.C.S is short for \"Autonomous Vehicle Intent Communication System.\" It's a prototype for communication between self-driving cars and other entities that will share roads. For our deliverable, I created a poster to showcase our user research process and our solution.",
      "leftImgPath": "/img/AVICS/poster-min.png",
      "siteLink": "/hq/avics-poster.pdf",
      "altText": "View Poster", 
      "atAGlance": [
        {
          "glanceTitle": "Tech Used",
          "glanceDet": "Sketch"
        },
        {
          "glanceTitle": "The Team",
          "glanceDet": "4 UX Researchers/Designers"
        },
        {
          "glanceTitle": "Main Takeaway",
          "glanceDet": "Getting interviewees that represent key target demographics is important and branding plays a large part of the presentation."
        },
        {
          "glanceTitle": "It Won Something",
          "glanceDet": "🏆 First place for Best Solution. All of the design projects produced in the class were judged by a panel of jurors including the Design Lab’s Don Norman."
        }
      ],
      "moreDet": 
      [
        {
          "moreDetTitle": "The Solution",
          "moreDetImgPath": [
            "/img/AVICS/solution.png"
          ],
          "moreDetContent": [
            "Our solution is an exterior interface that communicates the car’s intent to outside moving entities. There are two components, an icon that is displayed in the center of the window that communicates to pedestrians what the car expects them to do and a detection system that lets pedestrians know if the car is aware of their presence."
          ]
        },
        {
          "moreDetTitle": "The Goal",
          "moreDetContent": 
          [
            "To identify a problem from the broad issue of \"Autonomous Vehicles,\" to use Human-Centered Design to observe, ideate, and prototype a solution, and to use branding and visual design concepts to create an aesthetic and informative display to pitch the idea."
          ]
        },
        {
          "moreDetTitle": "The Background",
          "moreDetContent": 
          [
            "San Diego has been greenlighted as one of the 10 nationally-approved testing grounds for Autonomous Vehicles (AVs). With advancing technology and a ready market, a future with autonomous vehicles is rapidly approaching. However, many people are unsure about a future with autonomous cars and how to interact with them.",
            "Our team was tasked with a challenge to identify a specific problem within this scope and develop a solution for it. We used HCD techniques to design A.V.I.C.S, a prototype for communication between AVs and other entities that will share the roads."
          ]
        },
        {
          "moreDetTitle": "User Research",
          "moreDetContent": 
          [
            "In order to discover the root-cause problem, <span class=\"det-highlights\">we interviewed a variety of people from various backgrounds</span>. This included academics, citizens, and a rideshare provider. We wanted to obtain observations and opinions from a diverse set of people. We felt that there was value in considering both the issues that academics discovered from empirical testing as well as the gut-reaction concerns raised by citizens. Judging by the reactionary behavior within politics to other hot-button issues, both factors will come to into play especially as political influencers stoke emotions to gain support for their side.",
            "From our interviews, we identified four major trends:",
            "<ol class=\"paragraph-ul\"><li class=\"paragraph-li\"><span class=\"takeaway-category\">Impending Future Change:</span> people are aware that AVs are inevitable.</span></li><li class=\"paragraph-li\"><span class=\"takeaway-category\">Trust Issues:</span> with little exposure to AVs, people trust themselves more than they trust software.</span></li><li class=\"paragraph-li\"><span class=\"takeaway-category\">Concerns with Unpredictable Situations:</span> AVs struggle with unpredictable actions, particularly the “first and last mile,” which for AVs is the period of driving on local roads.</span></li><li class=\"paragraph-li\"><span class=\"takeaway-category\">Transition Period Conflicts:</span> when AVs are introduced, there will be a transitory period where people will have to learn how to interact with AVs. During this period, there will be conflicts as people form new road habits to accommodate the change.</span></li></ol>"
          ]
        },
        {
          "moreDetTitle": "Personas",
          "moreDetImgPath": [
            "/img/AVICS/personas.png"
          ], 
          "moreDetContent": 
          [
            "From these interviews, we created three personas. The three represented a retiree with concerns about handing the wheel over to software, a young adult who dislikes driving and is ready to hand over the keys, and a rideshare provider who has job safety concerns. The profiles are below and helped us think from the user's perspective."
          ]
        },
        {
          "moreDetTitle": "Problem Ideation",
          "moreDetImgPath": [
            "/img/AVICS/q-ideation.jpg"
          ], 
          "moreDetContent": 
          [
            "In order to narrow down our problem, we came up with broad questions that characterized the findings we found through our interviews. We then quickly developed solutions to each of these problems.",
            "The questions that had the most potential were:",
            "<ul id=\"glance-ul\"><li class=\"paragraph-li\">How can we create a reliable channel of communication between the driver and the AV?</li><li class=\"paragraph-li\">How can a car alert a pedestrian?</li></ul>",
            "We ideated on these questions, deepening the scope as well as detailing parts of our solution."
          ]
        },
        {
          "moreDetTitle": "First Draft Prototype",
          "moreDetContent": 
          [
            "Our first design focused more on created a channel of communication between the driver and the AV. One of our observations from our interviews was that a common fear was being in a collision caused by autonomous car that would have been preventable by human interference. In response to that, we developed a system where the driver would be alerted when a collision was going to happen.",
            "We pinpointed that a type of situation this would be necessary in was one where the car would not be able to avoid a collision. For instance, the AV is boxed in on the highway by human drivers and another car starts drifting over the line. To avoid that car, our AV would inevitably have to collide with another car, and so it would be best for the passenger to exercise judgement and make the tough decision. Our solution was a prediction system that would calculate when an impending collision would occur, would give a series of sound and written notifications and statistics to bring the passenger up to speed, and then unlock the wheel and let the passenger take control.",
            "We tested this idea through consulting experts and lay individuals and their critical feedback is summarized in the interview excerpts below:",
            "<ul id=\"glance-ul\"><li class=\"paragraph-li\">\"I think the biggest draw of an AV is to be hands-off and disengaged aspect. With this system, it’s like the only difference is that my hands aren’t on the wheel, I would need to be paying as much attention as I would driving manually. And in that case, I wouldn’t spend the extra money getting an AV.\"</li><li class=\"paragraph-li\">\"If you think about texting on the road and how dangerous it is because of the reaction time problem, I’m not sure how impactful alerting someone would be.\"</li><li class=\"paragraph-li\">\"In situations where the car made the mistake, how would it be able to successfully predict a collision?”</li></ul>",
            "Given that these were questions we felt we could not answer without substantial research that was outside the scope of our project, we decided to reframe our solution."
          ]
        },
        {
          "moreDetTitle": "Prototype Revision",
          "moreDetImgPath": [
            "/img/AVICS/q-post-its.jpg"
          ], 
          "moreDetContent": 
          [
            "We examined our two questions and found that there was a connection. They were both derivatives of the overarching question: <span class=\"det-highlights\">How can we establish trust between autonomous cars and humans?</span>",
            "We revisited our postits for potential solutions and honed in on two ideas:",
            "<ul id=\"glance-ul\"><li class=\"paragraph-li\">Haptic signals to communicate between the AV and the driver</li><li class=\"paragraph-li\">Visual digital display to receive constant feedback</li></ul>",
            "But this time, rather than focusing exclusively on the driver, we focused on the pedestrian. One observation that came up for our Bay Area interviewees is that most of of their struggles did not revolve around crashes. Those, while terrifying, were rare. The real struggle was trying to share a road alongside a machine that followed the rules to the strictest degree.",
            "Many drivers and pedestrians do not follow all of the rules of the road. They speed, they roll stops at stop signs, they don’t always signal, etc. This causes a need for necessary communication at places where people cross paths in order for traffic to flow smoothly. For instance, at an intersection, two cars might arrive at adjacent sides at the exact same time, and one car will wave the other on.",
            "However, AVs can’t yet read these types of signals. What ends up happening in these situations is that the AV calculates who arrived at the intersection first, and if no one moves after a set amount of time, the AV will begin to move forward. If the other car moves even the slightest, the AV, detecting movement, will stop. This causes the flow to be disrupted, as the AV will continue to start and stop and impatient drivers at the intersection will cut it off, causing it to stall even more.",
            "As a result, <span class=\"det-highlights\">we decided to frame our solution around this problem: how do we provide a system for self-driving cars to communicate to outside entities?</span>"
          ]
        },      
        {
          "moreDetTitle": "Storyboards",
          "moreDetImgPath": [
            "/img/AVICS/storyBoard.jpg"
          ], 
          "moreDetContent": 
          [
            "To help visualize a narrative in which our prototype would be useful, we created storyboards."
          ]
        },
        {
          "moreDetTitle": "Testing",
          "moreDetContent": 
          [
            "Although we did not have enough time to test our prototype, we came up with a method to do so. We would have test participants sit at an intersection, as either drivers of other cars or pedestrians crossing the street, while we sat in the “AV” in the other (an individual would be driving the car in a autonomous-car like fashion and a passenger would have paper-prototypes of the signals to flash on the window of the car). The test subject would then try to cross the intersection and use signals to complete this process as smoothly as possible.",
            "We would have used this information to inform us on the effectiveness of the model by analyzing recordings taken from the AV’s perspective, the test participant’s perspective, and bystanders from a corner of the intersection. We would have used metrics such as the number of stops made before the test subject successfully crossed the intersection, and the amount of time to quantify our analysis. We also would have interviewed the test subject to uncover additional observations."            
          ]
        },
        {
          "moreDetTitle": "The Poster",
          "moreDetImgPath": [], 
          "moreDetContent": 
          [
            "I designed the poster for our project. The goal was to design a 3x5 foot poster that detailed the process of discovering and details of our solution. With the amount of information and text, information architecture became highly important. Our headers and subheaders all were designed to make the poster easy to parse through.",
            "For organization, I broke the poster into three major sections: the background, the process, and the solution, and placed each section in a such a way that it could be easily and logically read. We inserted as many graphics as we could to break up the text. In some situations, namely our solution, graphics conveyed the information better than words could. A member of our team created a series of infographics to show to capabilities of our system."
          ]
        },
        {
          "moreDetTitle": "The Presentation Event",
          "moreDetImgPath": [
            "/img/AVICS/event-audience-min.jpg",
            "/img/AVICS/event-presentation-min.jpg"
          ], 
          "moreDetContent": 
          [
            "We presented our concept at a poster session at the end of the class. We were judged against 13 other teams on a number of criteria including thoroughness of user research, quality of proposed solution, and quality of the visual communication. The panel of jurors was composed of industry experts and included The Design Lab’s Don Norman.",
            "(Our solution won!)"
          ]
        },
        {
          "moreDetTitle": "The Takeaway",
          "moreDetContent": [
            "Especially on hot-button issues like autonomous vehicles, culture and previous experiences have deep influences on which concerns and benefits are important to the individual."
          ]
        },
        {
          "moreDetTitle": "Next Steps",
          "moreDetContent": [
            "The next steps for this project would be to conduct testing to see if the idea is viable. Details for our plan are listed in the \"Testing\" section above."
          ]
        }
      ]
    },
    {
      "bkgClass": "fusion",
      "year": "2015",
      "projectTitle": "Fusion XV",
      "detLabels": "GRAPHIC DESIGN, PRINT DESIGN",
      "detDescr": "Fusion is one of the biggest hip-hop dance competitions on the West Coast. I was on the graphics team for the 15th iteration, and I created watercolor-themed advertising posters and badges for the competition.",
      "leftImgPath": "/img/Fusion/fusionLogo.png", 
      "atAGlance": [
        {
          "glanceTitle": "Tech Used",
          "glanceDet": "Photoshop"
        },
        {
          "glanceTitle": "The Team",
          "glanceDet": "11 Graphic Artists"
        },
        {
          "glanceTitle": "A Fun Fact",
          "glanceDet": "5,000 people attended the competition"
        }
      ],
      "moreDet": 
      [
        {
          "moreDetTitle": "The Goal",
          "moreDetContent": 
          [
            "To create graphics for advertising and administrative purposes with a watercolor theme."
          ]
        },
        {
          "moreDetTitle": "Kickoff Event Advertisement Banner",
          "moreDetImgPath": [
            "/img/Fusion/ad-fusion-kickoff.png"
          ],
          "moreDetContent": 
          [
            "I designed this banner as an advertisement for the Fusion XV Kickoff event, a preshow dance showcase that was held to build anticipation for the main dance competition. This advertisement banner was shown at UCSD’s Price Center, the main student center, for two weeks. It was also later selected for use as a projected backdrop for the kickoff event itself."
          ]
        },
        {
          "moreDetImgPath": [
            "/img/Fusion/event-judges-sm-min.jpg"
          ],
          "moreDetContent": []
        },
        {
          "moreDetImgPath": [
            "/img/Fusion/event-audience-sm-min.jpg"
          ],
          "moreDetContent": []
        },
        {
          "moreDetTitle": "Name Tag Badges for the Main Competition",
          "moreDetImgPath": [
            "/img/Fusion/badges-tilt.jpg"
          ],
          "moreDetContent": [
            "I collaborated with another designer on the team to create badges for the participants and staff. These badges were used during the main competition. There were three different categories of individuals: Performers, MCs and Judges, and Staff, and are differentiated using different color schemes. The badges can be seen below."
          ]
        }
      ]
    },
    {
      "bkgClass": "iconography",
      "year": "VARIOUS",
      "projectTitle": "Icons & Logos",
      "detLabels": "GRAPHIC DESIGN",
      "detDescr": "I’ve made icons for various projects over the course of the years using Sketch and Illustrator. Below is a collection of them sorted by project.",
      "leftImgPath": "/img/icons/preview-icons-dt.png", 
      "moreDet": 
      [
        {
          "moreDetTitle": "Design for San Diego",
          "iconDump": [
            "/img/icons/designForSD/icon-eye-final.png",
            "/img/icons/designForSD/icon-hands-final.png",
            "/img/icons/designForSD/icon-bulb-final.jpg",
            "/img/icons/designForSD/icon-city-final.png"
          ],
          "iconType": "box"
        },
        {
          "iconDump": [
            "/img/icons/timeline/boat.png",
            "/img/icons/timeline/diagnose.png",
            "/img/icons/timeline/implement.png",
            "/img/icons/timeline/synthesize-2.png",
            "/img/icons/timeline/synthesize.png"
          ],
          "iconType": "box"
        },
        {
          "moreDetTitle": "Frank",
          "iconDump": [
            "/img/frank/icons/icon_clothing.png",
            "/img/frank/icons/icon_facialhair.png",
            "/img/frank/icons/icon_hairstyles.png",
            "/img/frank/icons/icon_makeup.png",
            "/img/frank/icons/icon_shoes.png",
            "/img/frank/icons/icons_clothing.png",
            "/img/frank/icons/file.png"
          ],
          "iconType": "no-bckgrd"
        },
        {
          "moreDetTitle": "laurenliu.me",
          "iconDump": [
            "/img/personal/logo.png"
          ],
          "iconType": "logo"
        },
        {
          "moreDetTitle": "D4SD",
          "iconDump": [
            "/img/d4sd/icons/diagnose.png",
            "/img/d4sd/icons/ideate.png",
            "/img/d4sd/icons/implement.png",
            "/img/d4sd/icons/propose.png"
          ],
          "iconType": "no-bckgrd"
        },
        {
          "moreDetTitle": "dopeLst",
          "iconDump": [
            "/img/dopelst/icon-edit.png",
            "/img/dopelst/icon-trash.png"
          ],
          "iconType": "no-bckgrd"
        },
        {
          "moreDetTitle": "Garden Club",
          "iconDump": [
            "/img/icons/gardenClub/logo-gtt-2.png"
          ],
          "iconType": "logo"
        }
      ]
    }
  ]
}